Revit 2026 API

# WorksetTableGetWorkset(WorksetId) Method

---

Returns the workset from a input WorksetId.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Workset GetWorkset(
	WorksetId id
)
```
```vb
Public Function GetWorkset (
	id As WorksetId
) As Workset
```
```cpp
public:
Workset^ GetWorkset(
	WorksetId^ id
)
```
```fsharp
member GetWorkset :
        id : WorksetId -> Workset
```

#### Parameters

id WorksetId
     Id of a workset.

#### Return Value

Workset The returned workset.  if there is no workset in this table with this Id.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

WorksetTable Class

GetWorkset Overload

Autodesk.Revit.DB Namespace